ka2_2024/src/Documents/ДвижениеПрочихАктивовПассивов/ДвижениеПрочихАктивовПассивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеПрочихАктивовПассивов</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСН</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ВыручкаИСебестоимостьПродаж</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>EnumRef.ТипыСтатейАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>EnumRef.ТипыСтатейАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>Увеличение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеОтражения</name>
    <attributes>
      <name>СтатьяИсточник</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиИсточник</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеИсточник</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивовИсточник</name>
      <type>
        <types>Characteristic.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходовИсточник</name>
      <type>
        <types>Characteristic.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовИсточник</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяПолучатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиПолучатель</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеПолучатель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивовПолучатель</name>
      <type>
        <types>Characteristic.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходовПолучатель</name>
      <type>
        <types>Characteristic.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовПолучатель</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Documents/ДвижениеПрочихАктивовПассивов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитовОперации;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Документы.ДвижениеПрочихАктивовПассивов.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		Источник,
		Получатель,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		МассивВсехРеквизитов,
		МассивРеквизитовОперации,
		МассивНепроверяемыхРеквизитов);
	
	Если Источник = Перечисления.ТипыСтатейАктивовПассивов.СтатьяАктивов
		ИЛИ Источник = Перечисления.ТипыСтатейАктивовПассивов.СтатьяПассивов Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДанныеОтражения.ПодразделениеИсточник");
	КонецЕсли;
		
	ПараметрыВыбораСтатейИАналитик = Документы.ДвижениеПрочихАктивовПассивов.ПараметрыВыбораСтатейИАналитик(Источник, Получатель);
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ИнициализироватьДокумент(ДанныеЗаполнения);
	ПараметрыВыбораСтатейИАналитик = Документы.ДвижениеПрочихАктивовПассивов.ПараметрыВыбораСтатейИАналитик(Источник, Получатель);
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ДвижениеПрочихАктивовПассивов.ПараметрыВыбораСтатейИАналитик(Источник, Получатель);
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)

	Организация		= ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Валюта			= Константы.ВалютаУправленческогоУчета.Получить();
	Ответственный	= Пользователи.ТекущийПользователь();
	Источник		= Перечисления.ТипыСтатейАктивовПассивов.СтатьяАктивов;
	Получатель		= Перечисления.ТипыСтатейАктивовПассивов.СтатьяАктивов;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
